{"weightsManifest": [{"paths": ["group1-shard1of21.bin", "group1-shard2of21.bin", "group1-shard3of21.bin", "group1-shard4of21.bin", "group1-shard5of21.bin", "group1-shard6of21.bin", "group1-shard7of21.bin", "group1-shard8of21.bin", "group1-shard9of21.bin", "group1-shard10of21.bin", "group1-shard11of21.bin", "group1-shard12of21.bin", "group1-shard13of21.bin", "group1-shard14of21.bin", "group1-shard15of21.bin", "group1-shard16of21.bin", "group1-shard17of21.bin", "group1-shard18of21.bin", "group1-shard19of21.bin", "group1-shard20of21.bin", "group1-shard21of21.bin"], "weights": [{"dtype": "float32", "shape": [25088, 256], "name": "dense/kernel"}, {"dtype": "float32", "shape": [256], "name": "dense/bias"}, {"dtype": "float32", "shape": [256, 2], "name": "dense_1/kernel"}, {"dtype": "float32", "shape": [2], "name": "dense_1/bias"}, {"dtype": "float32", "shape": [3, 3, 3, 64], "name": "block1_conv1/kernel"}, {"dtype": "float32", "shape": [64], "name": "block1_conv1/bias"}, {"dtype": "float32", "shape": [3, 3, 64, 64], "name": "block1_conv2/kernel"}, {"dtype": "float32", "shape": [64], "name": "block1_conv2/bias"}, {"dtype": "float32", "shape": [3, 3, 64, 128], "name": "block2_conv1/kernel"}, {"dtype": "float32", "shape": [128], "name": "block2_conv1/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 128], "name": "block2_conv2/kernel"}, {"dtype": "float32", "shape": [128], "name": "block2_conv2/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 256], "name": "block3_conv1/kernel"}, {"dtype": "float32", "shape": [256], "name": "block3_conv1/bias"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "block3_conv2/kernel"}, {"dtype": "float32", "shape": [256], "name": "block3_conv2/bias"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "block3_conv3/kernel"}, {"dtype": "float32", "shape": [256], "name": "block3_conv3/bias"}, {"dtype": "float32", "shape": [3, 3, 256, 512], "name": "block4_conv1/kernel"}, {"dtype": "float32", "shape": [512], "name": "block4_conv1/bias"}, {"dtype": "float32", "shape": [3, 3, 512, 512], "name": "block4_conv2/kernel"}, {"dtype": "float32", "shape": [512], "name": "block4_conv2/bias"}, {"dtype": "float32", "shape": [3, 3, 512, 512], "name": "block4_conv3/kernel"}, {"dtype": "float32", "shape": [512], "name": "block4_conv3/bias"}, {"dtype": "float32", "shape": [3, 3, 512, 512], "name": "block5_conv1/kernel"}, {"dtype": "float32", "shape": [512], "name": "block5_conv1/bias"}, {"dtype": "float32", "shape": [3, 3, 512, 512], "name": "block5_conv2/kernel"}, {"dtype": "float32", "shape": [512], "name": "block5_conv2/bias"}, {"dtype": "float32", "shape": [3, 3, 512, 512], "name": "block5_conv3/kernel"}, {"dtype": "float32", "shape": [512], "name": "block5_conv3/bias"}]}], "modelTopology": {"training_config": {"loss": "binary_crossentropy", "loss_weights": null, "metrics": ["accuracy"], "optimizer_config": {"class_name": "SGD", "config": {"nesterov": false, "learning_rate": 9.999999747378752e-06, "name": "SGD", "momentum": 0.8999999761581421, "decay": 0.0}}, "weighted_metrics": null, "sample_weight_mode": null}, "keras_version": "2.3.0-tf", "model_config": {"class_name": "Sequential", "config": {"layers": [{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"ragged": false, "dtype": "float32", "batch_input_shape": [null, 224, 224, 3], "name": "input_1", "sparse": false}, "name": "input_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "block1_conv1", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block1_conv1"}, {"class_name": "Conv2D", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "block1_conv2", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block1_conv2"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "config": {"name": "block1_pool", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "name": "block1_pool"}, {"class_name": "Conv2D", "inbound_nodes": [[["block1_pool", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "block2_conv1", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block2_conv1"}, {"class_name": "Conv2D", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "block2_conv2", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block2_conv2"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "config": {"name": "block2_pool", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "name": "block2_pool"}, {"class_name": "Conv2D", "inbound_nodes": [[["block2_pool", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "block3_conv1", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block3_conv1"}, {"class_name": "Conv2D", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "block3_conv2", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block3_conv2"}, {"class_name": "Conv2D", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "block3_conv3", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block3_conv3"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]], "config": {"name": "block3_pool", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "name": "block3_pool"}, {"class_name": "Conv2D", "inbound_nodes": [[["block3_pool", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "block4_conv1", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block4_conv1"}, {"class_name": "Conv2D", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "block4_conv2", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block4_conv2"}, {"class_name": "Conv2D", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "block4_conv3", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block4_conv3"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]], "config": {"name": "block4_pool", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "name": "block4_pool"}, {"class_name": "Conv2D", "inbound_nodes": [[["block4_pool", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "block5_conv1", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block5_conv1"}, {"class_name": "Conv2D", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "block5_conv2", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block5_conv2"}, {"class_name": "Conv2D", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "block5_conv3", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block5_conv3"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]], "config": {"name": "block5_pool", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "name": "block5_pool"}], "output_layers": [["block5_pool", 0, 0]], "batch_input_shape": [null, 224, 224, 3], "name": "vgg16", "input_layers": [["input_1", 0, 0]]}}, {"class_name": "Flatten", "config": {"dtype": "float32", "trainable": true, "name": "flatten", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout", "dtype": "float32", "trainable": true, "rate": 0.3, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "dense", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "dtype": "float32", "trainable": true, "rate": 0.5, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "dense_1", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "use_bias": true, "activity_regularizer": null}}], "build_input_shape": [null, 224, 224, 3], "name": "sequential"}}, "backend": "tensorflow"}, "generatedBy": "keras v2.3.0-tf", "convertedBy": "TensorFlow.js Converter v3.0.0", "format": "layers-model"}